In [1]:
import pandas as pd
import numpy as np

In [5]:
index = pd.date_range('20200921', periods=8)
index

DatetimeIndex(['2020-09-21', '2020-09-22', '2020-09-23', '2020-09-24',
               '2020-09-25', '2020-09-26', '2020-09-27', '2020-09-28'],
              dtype='datetime64[ns]', freq='D')

In [6]:
s = pd.Series(np.random.rand(4), index = ['a','b','c','d'])
s

a    0.908245
b    0.285090
c    0.070388
d    0.547087
dtype: float64

In [7]:
df = pd.DataFrame(np.random.rand(8,3), index=index, columns=['A','B','C'])
df

                   A         B         C
2020-09-21  0.417621  0.765341  0.051163
2020-09-22  0.404671  0.602588  0.883384
2020-09-23  0.177959  0.854689  0.212353
2020-09-24  0.022410  0.364582  0.418143
2020-09-25  0.815911  0.781278  0.862270
2020-09-26  0.954861  0.948716  0.138616
2020-09-27  0.341707  0.690419  0.163668
2020-09-28  0.544099  0.778408  0.990354

In [12]:
long_series = pd.Series(np.random.rand(1000))
long_series

0      0.445386
1      0.031278
2      0.937494
3      0.619021
4      0.328614
         ...
995    0.338628
996    0.995585
997    0.446370
998    0.506439
999    0.490387
Length: 1000, dtype: float64

In [13]:
long_series.head()

0    0.445386
1    0.031278
2    0.937494
3    0.619021
4    0.328614
dtype: float64

In [14]:
long_series.tail()

995    0.338628
996    0.995585
997    0.446370
998    0.506439
999    0.490387
dtype: float64

In [15]:
s.array

<PandasArray>
[0.9082447962651332, 0.285090303299798, 0.07038835980577385,
 0.547086952462458]
Length: 4, dtype: float64

In [16]:
s.index.array

<PandasArray>
['a', 'b', 'c', 'd']
Length: 4, dtype: object

In [17]:
s.to_numpy()

array([0.9082448 , 0.2850903 , 0.07038836, 0.54708695])

In [18]:
np.asarray(s)

array([0.9082448 , 0.2850903 , 0.07038836, 0.54708695])

In [19]:
df

                   A         B         C
2020-09-21  0.417621  0.765341  0.051163
2020-09-22  0.404671  0.602588  0.883384
2020-09-23  0.177959  0.854689  0.212353
2020-09-24  0.022410  0.364582  0.418143
2020-09-25  0.815911  0.781278  0.862270
2020-09-26  0.954861  0.948716  0.138616
2020-09-27  0.341707  0.690419  0.163668
2020-09-28  0.544099  0.778408  0.990354

In [20]:
df.to_numpy()

array([[0.41762064, 0.76534104, 0.05116298],
       [0.4046706 , 0.60258848, 0.88338433],
       [0.17795894, 0.85468885, 0.21235282],
       [0.02241014, 0.36458182, 0.41814323],
       [0.81591131, 0.78127786, 0.8622703 ],
       [0.954861  , 0.9487162 , 0.13861631],
       [0.34170716, 0.69041858, 0.163668  ],
       [0.54409933, 0.77840762, 0.99035402]])

In [21]:
df = pd.DataFrame(
    {
        "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
        "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
    }
)
df

        one       two     three
a  0.054898  0.410878       NaN
b  0.149071 -0.959357  1.526580
c -1.823742 -1.208240 -0.242519
d       NaN -0.995253  0.734581

In [27]:
row = df.iloc[1:3]
row

        one       two     three
b  0.149071 -0.959357  1.526580
c -1.823742 -1.208240 -0.242519

In [29]:
df.sub(row, axis = 'columns')

   one  two  three
a  NaN  NaN    NaN
b  0.0  0.0    0.0
c  0.0  0.0    0.0
d  NaN  NaN    NaN

In [33]:
df.sub(row, axis = 1)

   one  two  three
a  NaN  NaN    NaN
b  0.0  0.0    0.0
c  0.0  0.0    0.0
d  NaN  NaN    NaN

In [36]:
df1 = df.copy()
df1.index = pd.MultiIndex.from_tuples(
    [(1,'a'), (1, 'b'), (1,'a'), (2, 'b')], names= ['first', 'second']
)
df1

                   one       two     three
first second
1     a       0.054898  0.410878       NaN
      b       0.149071 -0.959357  1.526580
      a      -1.823742 -1.208240 -0.242519
2     b            NaN -0.995253  0.734581

In [37]:
s = pd.Series(np.arange(10))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [39]:
div, rem = divmod(s, 3)
div, rem

(0    0
 1    0
 2    0
 3    1
 4    1
 5    1
 6    2
 7    2
 8    2
 9    3
 dtype: int32,
 0    0
 1    1
 2    2
 3    0
 4    1
 5    2
 6    0
 7    1
 8    2
 9    0
 dtype: int32)

In [41]:
inx = pd.Index(np.arange(10))
inx

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [42]:
div, rem = divmod(inx, 3)

In [43]:
div

Int64Index([0, 0, 0, 1, 1, 1, 2, 2, 2, 3], dtype='int64')

In [44]:
rem

Int64Index([0, 1, 2, 0, 1, 2, 0, 1, 2, 0], dtype='int64')

Missing data / operations with fill values

In [45]:
df

        one       two     three
a  0.054898  0.410878       NaN
b  0.149071 -0.959357  1.526580
c -1.823742 -1.208240 -0.242519
d       NaN -0.995253  0.734581

In [52]:
df2 = df.copy()
df2.iloc[0,2] = 1
df2

        one       two     three
a  0.054898  0.410878  1.000000
b  0.149071 -0.959357  1.526580
c -1.823742 -1.208240 -0.242519
d       NaN -0.995253  0.734581

In [53]:
df + df2

        one       two     three
a  0.109796  0.821756       NaN
b  0.298143 -1.918715  3.053160
c -3.647485 -2.416480 -0.485037
d       NaN -1.990506  1.469162

In [54]:
df.add(df2, fill_value=0)

        one       two     three
a  0.109796  0.821756  1.000000
b  0.298143 -1.918715  3.053160
c -3.647485 -2.416480 -0.485037
d       NaN -1.990506  1.469162

Flexible comparisons

In [55]:
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [56]:
df2.ne(df)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [57]:
df

        one       two     three
a  0.054898  0.410878       NaN
b  0.149071 -0.959357  1.526580
c -1.823742 -1.208240 -0.242519
d       NaN -0.995253  0.734581

In [58]:
(df > 0).all()

one      False
two      False
three    False
dtype: bool

In [59]:
(df > 0 ).any()

one      True
two      True
three    True
dtype: bool

In [60]:
df.empty

False

Comparing if objects are equivalent

In [64]:
df + df == df * 2

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [65]:
np.nan == np.nan

False

In [66]:
( df + df).equals(df * 2)

True

Comparing array-like objects

In [68]:
pd.Series(['foo', 'Naa', 'Baz']) == 'foo'

0     True
1    False
2    False
dtype: bool

In [69]:
pd.Index(['foo', 'Naa', 'Baz']) == 'Naa'

array([False,  True, False])

In [72]:
np.array([1,2,3]) == np.array([3])

array([False, False,  True])

Combining overlapping data sets

In [73]:
df1 = pd.DataFrame(
     {"A": [1.0, np.nan, 3.0, 5.0, np.nan], "B": [np.nan, 2.0, 3.0, np.nan, 6.0]}
 )
df2 = pd.DataFrame(
     {
         "A": [5.0, 2.0, 4.0, np.nan, 3.0, 7.0],
         "B": [np.nan, np.nan, 3.0, 4.0, 6.0, 8.0],
     }
 )

In [74]:
df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

In [75]:
df2

     A    B
0  5.0  NaN
1  2.0  NaN
2  4.0  3.0
3  NaN  4.0
4  3.0  6.0
5  7.0  8.0

In [76]:
df1.combine_first(df2)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

In [77]:
df

        one       two     three
a  0.054898  0.410878       NaN
b  0.149071 -0.959357  1.526580
c -1.823742 -1.208240 -0.242519
d       NaN -0.995253  0.734581

In [80]:
df.mean(0)

one     -0.539924
two     -0.687993
three    0.672881
dtype: float64

In [79]:
df.mean(1)

a    0.232888
b    0.238765
c   -1.091500
d   -0.130336
dtype: float64

In [81]:
df.sum(0, skipna=False)

one           NaN
two     -2.751973
three         NaN
dtype: float64

In [82]:
df.sum(0, skipna=True)

one     -1.619773
two     -2.751973
three    2.018643
dtype: float64

In [83]:
df.std()

one      1.112816
two      0.740770
three    0.886162
dtype: float64

In [84]:
df.cumsum()

        one       two     three
a  0.054898  0.410878       NaN
b  0.203969 -0.548480  1.526580
c -1.619773 -1.756720  1.284061
d       NaN -2.751973  2.018643

In [86]:
df

        one       two     three
a  0.054898  0.410878       NaN
b  0.149071 -0.959357  1.526580
c -1.823742 -1.208240 -0.242519
d       NaN -0.995253  0.734581

Summarizing data: describe

In [3]:
series = pd.Series(np.random.rand(1000))
series.describe()

count    1000.000000
mean        0.495691
std         0.290068
min         0.000365
25%         0.246755
50%         0.484223
75%         0.746014
max         0.996261
dtype: float64

In [6]:
series.describe(percentiles=[0.05,0.25, 0.50, 0.75, 0.99])

count    1000.000000
mean        0.495691
std         0.290068
min         0.000365
5%          0.056237
25%         0.246755
50%         0.484223
75%         0.746014
99%         0.988749
max         0.996261
dtype: float64

In [7]:
s = pd.Series(["a", "a", "b", "b", "a", "a", np.nan, "c", "d", "a"])
s.describe()

count     9
unique    4
top       a
freq      5
dtype: object

In [8]:
frame = pd.DataFrame({"a": ["Yes", "Yes", "No", "No"], "b": range(4)})
frame.describe()

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [9]:
frame.describe(include=[object])

         a
count    4
unique   2
top     No
freq     2

In [10]:
frame.describe(include=['number'])

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [12]:
frame.describe(include='all')

          a         b
count     4  4.000000
unique    2       NaN
top      No       NaN
freq      2       NaN
mean    NaN  1.500000
std     NaN  1.290994
min     NaN  0.000000
25%     NaN  0.750000
50%     NaN  1.500000
75%     NaN  2.250000
max     NaN  3.000000

Index of min/max values

In [7]:
s1 = pd.Series(np.random.rand(5))
s1.idxmin(), s1.idxmax()

(0, 2)

In [8]:
df1 = pd.DataFrame(np.random.rand(5,3), columns = ['A','B','C'])
df1

          A         B         C
0  0.813352  0.404526  0.642935
1  0.024512  0.700812  0.220851
2  0.960477  0.167855  0.480136
3  0.423050  0.402769  0.292894
4  0.775797  0.464537  0.092974

In [10]:
df1.idxmin(axis=0)

A    1
B    2
C    4
dtype: int64

In [11]:
df1.idxmax(axis=1)

0    A
1    B
2    A
3    A
4    A
dtype: object

In [14]:
df2 = pd.DataFrame([2, 1, 1, 3, np.nan], columns=["A"], index=list('asrgh'))
df2['A'].idxmax()

'g'

In [19]:
data = np.random.randint(0, 7, 50)
data

array([6, 5, 3, 0, 3, 5, 0, 6, 4, 1, 3, 0, 5, 6, 6, 1, 4, 6, 5, 0, 2, 5,
       2, 0, 3, 1, 5, 4, 5, 2, 1, 2, 0, 1, 4, 5, 3, 6, 2, 6, 6, 3, 4, 5,
       6, 5, 2, 2, 2, 3])

In [20]:
s = pd.Series(data)
s.value_counts()

5    10
6     9
2     8
3     7
0     6
4     5
1     5
dtype: int64

In [27]:
data = {"a": [1, 1, 3, 4], "b": ["x", "x", "y", "y"], 'c':['A','A','C','D']}
frame = pd.DataFrame(data)
frame

   a  b  c
0  1  x  A
1  2  x  A
2  3  y  C
3  4  y  D

In [29]:
frame.value_counts()

a  b  c
4  y  D    1
3  y  C    1
2  x  A    1
1  x  A    1
dtype: int64

In [31]:
s5 = pd.Series([1, 1, 3, 3, 3, 5, 5, 7, 7, 7, 7])
s5.mode()

0    7
dtype: int64

In [32]:
df5 = pd.DataFrame({
    'A': np.random.randint(0, 7, size=50),
    'B': np.random.randint(-10, 15, size=50)
})

In [33]:
df5.mode()

   A    B
0  2 -4.0
1  5  NaN

Discretization and quantiling

In [34]:
arr = np.random.rand(20)

In [35]:
factor= pd.cut(arr, 4)
factor

[(0.512, 0.754], (0.754, 0.996], (0.754, 0.996], (0.0272, 0.27], (0.27, 0.512], ..., (0.754, 0.996], (0.0272, 0.27], (0.754, 0.996], (0.27, 0.512], (0.512, 0.754]]
Length: 20
Categories (4, interval[float64]): [(0.0272, 0.27] < (0.27, 0.512] < (0.512, 0.754] < (0.754, 0.996]]

In [38]:
factor = pd.cut(arr, [-5, -1, 0, 1, 5])
factor

[(0, 1], (0, 1], (0, 1], (0, 1], (0, 1], ..., (0, 1], (0, 1], (0, 1], (0, 1], (0, 1]]
Length: 20
Categories (4, interval[int64]): [(-5, -1] < (-1, 0] < (0, 1] < (1, 5]]

In [43]:
arr = np.random.rand(30)
factor = pd.qcut(arr, [0, 0.25, 0.5, 0.75, 1])
factor

[(0.331, 0.511], (0.511, 0.732], (0.0072299999999999994, 0.331], (0.0072299999999999994, 0.331], (0.331, 0.511], ..., (0.732, 0.977], (0.732, 0.977], (0.511, 0.732], (0.0072299999999999994, 0.331], (0.511, 0.732]]
Length: 30
Categories (4, interval[float64]): [(0.0072299999999999994, 0.331] < (0.331, 0.511] < (0.511, 0.732] < (0.732, 0.977]]

In [44]:
pd.value_counts(factor)

(0.732, 0.977]                    8
(0.0072299999999999994, 0.331]    8
(0.511, 0.732]                    7
(0.331, 0.511]                    7
dtype: int64

Function application

In [46]:
def extract_city_name(df):
    df['city_name'] = df['city_and_code'].str.split(',').str.get(0)
    return df
def add_country_name(df, country_name=None):
    col = 'city_name'
    df['city_and_country'] = df[col] + country_name
df_p = pd.DataFrame({"city_and_code": ["Chicago, IL"]})
df_p

  city_and_code
0   Chicago, IL

In [49]:
add_country_name(extract_city_name(df_p), country_name='US')
df_p

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [52]:
df_p.pipe(extract_city_name).pipe(add_country_name, country_name='US')
df_pd

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

Row or column-wise function application

In [55]:
df = pd.DataFrame(np.random.rand(10, 3), columns=['A','B','C'])
df

          A         B         C
0  0.887211  0.123147  0.482758
1  0.400105  0.571877  0.318226
2  0.268083  0.638840  0.431636
3  0.347990  0.689495  0.588504
4  0.464299  0.353560  0.570197
5  0.182236  0.145819  0.478635
6  0.208530  0.259523  0.504836
7  0.082911  0.329964  0.036009
8  0.254657  0.513316  0.788082
9  0.145582  0.849115  0.663667

In [56]:
df.apply(np.mean)

A    0.324160
B    0.447466
C    0.486255
dtype: float64

In [57]:
df.apply(np.mean, axis=1)

0    0.497705
1    0.430069
2    0.446187
3    0.541997
4    0.462685
5    0.268897
6    0.324296
7    0.149628
8    0.518685
9    0.552788
dtype: float64

In [59]:
df.apply(lambda x: x.max()-x.min())

A    0.804300
B    0.725969
C    0.752073
dtype: float64

In [60]:
df.apply(np.cumsum)

          A         B         C
0  0.887211  0.123147  0.482758
1  1.287315  0.695024  0.800984
2  1.555399  1.333864  1.232620
3  1.903389  2.023360  1.821125
4  2.367688  2.376920  2.391322
5  2.549924  2.522738  2.869957
6  2.758454  2.782261  3.374793
7  2.841365  3.112225  3.410802
8  3.096021  3.625542  4.198884
9  3.241604  4.474657  4.862550

In [61]:
df.apply(np.exp)

          A         B         C
0  2.428347  1.131050  1.620538
1  1.491981  1.771590  1.374687
2  1.307456  1.894283  1.539775
3  1.416219  1.992710  1.801292
4  1.590898  1.424128  1.768616
5  1.199898  1.156987  1.613870
6  1.231866  1.296312  1.656713
7  1.086445  1.390918  1.036665
8  1.290019  1.670823  2.199175
9  1.156713  2.337578  1.941899

In [65]:
tsdf = pd.DataFrame(
     np.random.randn(15, 3),
     columns=["A", "B", "C"],
     index=pd.date_range("1/1/2000", periods=15),
 )

In [68]:
tsdf[4:8] = np.nan
tsdf

                   A         B         C
2000-01-01  1.678767  0.787196 -0.687807
2000-01-02  1.040473 -0.874401  0.009337
2000-01-03  0.428827  0.807267 -0.837880
2000-01-04 -0.147075 -0.081098  0.284500
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN
2000-01-09 -2.332660 -0.690181  1.522199
2000-01-10  1.818144  0.000258 -0.209434
2000-01-11  1.600098 -0.151443 -0.216813
2000-01-12 -1.149455  0.806021 -0.508030
2000-01-13  0.756153 -0.314707  0.267228
2000-01-14  1.218446 -0.830828  0.320466
2000-01-15 -2.486099 -0.748669  1.889265

In [70]:
tsdf.apply(pd.Series.interpolate)

                   A         B         C
2000-01-01  1.678767  0.787196 -0.687807
2000-01-02  1.040473 -0.874401  0.009337
2000-01-03  0.428827  0.807267 -0.837880
2000-01-04 -0.147075 -0.081098  0.284500
2000-01-05 -0.584192 -0.202914  0.532040
2000-01-06 -1.021309 -0.324731  0.779580
2000-01-07 -1.458426 -0.446548  1.027119
2000-01-08 -1.895543 -0.568364  1.274659
2000-01-09 -2.332660 -0.690181  1.522199
2000-01-10  1.818144  0.000258 -0.209434
2000-01-11  1.600098 -0.151443 -0.216813
2000-01-12 -1.149455  0.806021 -0.508030
2000-01-13  0.756153 -0.314707  0.267228
2000-01-14  1.218446 -0.830828  0.320466
2000-01-15 -2.486099 -0.748669  1.889265

Aggregation API

In [72]:
tsdf = pd.DataFrame(
     np.random.randn(10, 3),
     columns=["A", "B", "C"],
     index=pd.date_range("1/1/2000", periods=10),
 )
tsdf[3:7] = np.nan
tsdf

                   A         B         C
2000-01-01 -0.385619  1.539404  0.743380
2000-01-02  0.336139  1.216800 -1.055651
2000-01-03 -0.323367  1.458670 -1.648350
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08 -0.510827 -0.539124 -2.261282
2000-01-09 -0.225460 -2.287002 -1.098985
2000-01-10 -0.181218  0.953971  0.718085

In [73]:
tsdf.agg(np.sum)

A   -1.290352
B    2.342719
C   -4.602803
dtype: float64

In [74]:
tsdf.agg('sum')

A   -1.290352
B    2.342719
C   -4.602803
dtype: float64

In [75]:
tsdf.sum()

A   -1.290352
B    2.342719
C   -4.602803
dtype: float64

Aggregating with multiple functions

In [76]:
tsdf.agg(['sum'])

            A         B         C
sum -1.290352  2.342719 -4.602803

In [77]:
tsdf.agg(['sum', 'mean'])

             A         B         C
sum  -1.290352  2.342719 -4.602803
mean -0.215059  0.390453 -0.767134

In [80]:
tsdf["A"].agg(['sum', 'mean'])

sum    -1.290352
mean   -0.215059
Name: A, dtype: float64

In [83]:
def mymean(x):
    return x.mean()
tsdf['A'].agg(['sum', mymean])

sum      -1.290352
mymean   -0.215059
Name: A, dtype: float64

Aggregating with a dict

In [84]:
tsdf.agg({'A': 'sum', 'B': 'mean'})

A   -1.290352
B    0.390453
dtype: float64

In [86]:
tsdf.agg({'A':['sum', 'min'], 'B': ['mean', 'max']})

             A         B
max        NaN  1.539404
mean       NaN  0.390453
min  -0.510827       NaN
sum  -1.290352       NaN

In [88]:
mdf = pd.DataFrame(
     {
         "A": [1, 2, 3],
         "B": [1.0, 2.0, 3.0],
         "C": ["foo", "bar", "baz"],
         "D": pd.date_range("20130101", periods=3),
     }
 )
mdf.dtypes

A             int64
B           float64
C            object
D    datetime64[ns]
dtype: object

In [90]:
mdf.agg(['mean', 'max', 'sum'])

        A    B          C          D
mean  2.0  2.0        NaN 2013-01-02
max   3.0  3.0        foo 2013-01-03
sum   6.0  6.0  foobarbaz        NaT

Custom describe

In [95]:
from functools import partial

q_25 = partial(pd.Series.quantile, q=0.25)
q_25._name_ = '25%'
q_75 = partial(pd.Series.quantile, q=0.75)
q_75._name_ = '75%'
tsdf.agg(['count', q_25, q_75])

                 A         B         C
count     6.000000  6.000000  6.000000
quantile -0.370056 -0.165850 -1.511009
quantile -0.192278  1.398203  0.274651

Transform API

In [5]:
tsdf = pd.DataFrame(
    np.random.randn(10, 3),
    columns = ['A', 'B', 'C'],
    index = pd.date_range('1/1/2000', periods=10)
)
tsdf

                   A         B         C
2000-01-01  1.076456  0.081575 -0.860879
2000-01-02 -0.663582  0.412722 -1.735090
2000-01-03  0.740728 -0.051219  0.988866
2000-01-04  0.829814  2.243352  2.203261
2000-01-05  0.552002 -1.924343  0.282562
2000-01-06  0.027014 -1.222884 -1.068744
2000-01-07 -0.081357 -0.199154 -0.281557
2000-01-08 -1.320825  0.177935  1.932914
2000-01-09 -0.365989 -0.177421  0.529970
2000-01-10 -1.129716  0.973019 -0.230505

In [6]:
tsdf.transform(np.abs)

                   A         B         C
2000-01-01  1.076456  0.081575  0.860879
2000-01-02  0.663582  0.412722  1.735090
2000-01-03  0.740728  0.051219  0.988866
2000-01-04  0.829814  2.243352  2.203261
2000-01-05  0.552002  1.924343  0.282562
2000-01-06  0.027014  1.222884  1.068744
2000-01-07  0.081357  0.199154  0.281557
2000-01-08  1.320825  0.177935  1.932914
2000-01-09  0.365989  0.177421  0.529970
2000-01-10  1.129716  0.973019  0.230505

In [7]:
tsdf.transform('abs')

                   A         B         C
2000-01-01  1.076456  0.081575  0.860879
2000-01-02  0.663582  0.412722  1.735090
2000-01-03  0.740728  0.051219  0.988866
2000-01-04  0.829814  2.243352  2.203261
2000-01-05  0.552002  1.924343  0.282562
2000-01-06  0.027014  1.222884  1.068744
2000-01-07  0.081357  0.199154  0.281557
2000-01-08  1.320825  0.177935  1.932914
2000-01-09  0.365989  0.177421  0.529970
2000-01-10  1.129716  0.973019  0.230505

In [8]:
tsdf.transform(lambda x: x.abs())

                   A         B         C
2000-01-01  1.076456  0.081575  0.860879
2000-01-02  0.663582  0.412722  1.735090
2000-01-03  0.740728  0.051219  0.988866
2000-01-04  0.829814  2.243352  2.203261
2000-01-05  0.552002  1.924343  0.282562
2000-01-06  0.027014  1.222884  1.068744
2000-01-07  0.081357  0.199154  0.281557
2000-01-08  1.320825  0.177935  1.932914
2000-01-09  0.365989  0.177421  0.529970
2000-01-10  1.129716  0.973019  0.230505

In [9]:
np.abs(tsdf)

                   A         B         C
2000-01-01  1.076456  0.081575  0.860879
2000-01-02  0.663582  0.412722  1.735090
2000-01-03  0.740728  0.051219  0.988866
2000-01-04  0.829814  2.243352  2.203261
2000-01-05  0.552002  1.924343  0.282562
2000-01-06  0.027014  1.222884  1.068744
2000-01-07  0.081357  0.199154  0.281557
2000-01-08  1.320825  0.177935  1.932914
2000-01-09  0.365989  0.177421  0.529970
2000-01-10  1.129716  0.973019  0.230505

Transform with multiple functions

In [10]:
tsdf.transform([np.abs, lambda x: x+ 1])

                   A                    B                    C
            absolute <lambda_0>  absolute <lambda_0>  absolute <lambda_0>
2000-01-01  1.076456   2.076456  0.081575   1.081575  0.860879   0.139121
2000-01-02  0.663582   0.336418  0.412722   1.412722  1.735090  -0.735090
2000-01-03  0.740728   1.740728  0.051219   0.948781  0.988866   1.988866
2000-01-04  0.829814   1.829814  2.243352   3.243352  2.203261   3.203261
2000-01-05  0.552002   1.552002  1.924343  -0.924343  0.282562   1.282562
2000-01-06  0.027014   1.027014  1.222884  -0.222884  1.068744  -0.068744
2000-01-07  0.081357   0.918643  0.199154   0.800846  0.281557   0.718443
2000-01-08  1.320825  -0.320825  0.177935   1.177935  1.932914   2.932914
2000-01-09  0.365989   0.634011  0.177421   0.822579  0.529970   1.529970
2000-01-10  1.129716  -0.129716  0.973019   1.973019  0.230505   0.769495

In [12]:
tsdf.transform({'A': np.abs, 'B': lambda x: x + 1})

                   A         B
2000-01-01  1.076456  1.081575
2000-01-02  0.663582  1.412722
2000-01-03  0.740728  0.948781
2000-01-04  0.829814  3.243352
2000-01-05  0.552002 -0.924343
2000-01-06  0.027014 -0.222884
2000-01-07  0.081357  0.800846
2000-01-08  1.320825  1.177935
2000-01-09  0.365989  0.822579
2000-01-10  1.129716  1.973019

In [17]:
tsdf.transform({'A': np.abs, 'B': [lambda x: x + 1, 'sqrt']})

C:\Users\User\Anaconda3\lib\site-packages\pandas\core\series.py:726: RuntimeWarning: invalid value encountered in sqrt
  result = getattr(ufunc, method)(*inputs, **kwargs)

                   A          B
            absolute <lambda_0>      sqrt
2000-01-01  1.076456   1.081575  0.285613
2000-01-02  0.663582   1.412722  0.642435
2000-01-03  0.740728   0.948781       NaN
2000-01-04  0.829814   3.243352  1.497782
2000-01-05  0.552002  -0.924343       NaN
2000-01-06  0.027014  -0.222884       NaN
2000-01-07  0.081357   0.800846       NaN
2000-01-08  1.320825   1.177935  0.421824
2000-01-09  0.365989   0.822579       NaN
2000-01-10  1.129716   1.973019  0.986417

In [20]:
df4 = pd.DataFrame(np.random.rand(4,3), columns=['A','B','C'], index=['a','b','c','d'])
df4

          A         B         C
a  0.310752  0.704818  0.708264
b  0.257842  0.739861  0.220715
c  0.999507  0.472857  0.610499
d  0.397220  0.841648  0.001897

In [21]:
def f(x):
    return len(str(x))

In [23]:
df4['A'].map(f)

a    18
b    19
c    18
d    18
Name: A, dtype: int64

In [25]:
df4.applymap(f)

    A   B   C
a  18  18  18
b  19  18  18
c  18  18  18
d  18  17  21

In [26]:
s = pd.Series(
     ["six", "seven", "six", "seven", "six"], index=["a", "b", "c", "d", "e"]
 )

In [27]:
t = pd.Series({'six':6.0, 'seven':7.0})
s

a      six
b    seven
c      six
d    seven
e      six
dtype: object

In [28]:
s.map(t)

a    6.0
b    7.0
c    6.0
d    7.0
e    6.0
dtype: float64

Reindexing and altering labels

In [29]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])

In [34]:
s.reindex(['d','r','b','h','a'])

d    0.335969
r         NaN
b   -0.950393
h         NaN
a   -0.907253
dtype: float64

In [36]:
df4

          A         B         C
a  0.310752  0.704818  0.708264
b  0.257842  0.739861  0.220715
c  0.999507  0.472857  0.610499
d  0.397220  0.841648  0.001897

In [39]:
df4.reindex(['c','d','b','a'], columns=['B','C','A'])

          B         C         A
c  0.472857  0.610499  0.999507
d  0.841648  0.001897  0.397220
b  0.739861  0.220715  0.257842
a  0.704818  0.708264  0.310752

In [41]:
df4.reindex(['c','b','c'], axis='index')

          A         B         C
c  0.999507  0.472857  0.610499
b  0.257842  0.739861  0.220715
c  0.999507  0.472857  0.610499

In [42]:
df4.reindex(['B','A','C'], axis='columns')

          B         A         C
a  0.704818  0.310752  0.708264
b  0.739861  0.257842  0.220715
c  0.472857  0.999507  0.610499
d  0.841648  0.397220  0.001897

Reindexing to align with another object

In [48]:
df1 = pd.DataFrame(np.random.rand(2,2), index=['a','b'], columns=['A', 'B'])
df2 = pd.DataFrame(np.random.rand(2,2), index=['b','a'], columns=['B', 'A'])

In [49]:
df1

          A         B
a  0.241850  0.423629
b  0.531717  0.447897

In [50]:
df2

          B         A
b  0.482682  0.370908
a  0.580466  0.087741

In [51]:
df1.reindex_like(df2)

          B         A
b  0.447897  0.531717
a  0.423629  0.241850

Aligning objects with each other with

In [53]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
s

a    0.881986
b   -0.067821
c   -0.414538
d    1.778442
e    0.030210
dtype: float64

In [54]:
s1 = s[:4]
s1

a    0.881986
b   -0.067821
c   -0.414538
d    1.778442
dtype: float64

In [55]:
s2 = s[1:]
s2

b   -0.067821
c   -0.414538
d    1.778442
e    0.030210
dtype: float64

In [56]:
s1.align(s2)

(a    0.881986
 b   -0.067821
 c   -0.414538
 d    1.778442
 e         NaN
 dtype: float64,
 a         NaN
 b   -0.067821
 c   -0.414538
 d    1.778442
 e    0.030210
 dtype: float64)

In [57]:
s1.align(s2, join = 'inner')

(b   -0.067821
 c   -0.414538
 d    1.778442
 dtype: float64,
 b   -0.067821
 c   -0.414538
 d    1.778442
 dtype: float64)

In [58]:
s1.align(s2, join='left')

(a    0.881986
 b   -0.067821
 c   -0.414538
 d    1.778442
 dtype: float64,
 a         NaN
 b   -0.067821
 c   -0.414538
 d    1.778442
 dtype: float64)

In [59]:
s1.align(s2, join='right')

(b   -0.067821
 c   -0.414538
 d    1.778442
 e         NaN
 dtype: float64,
 b   -0.067821
 c   -0.414538
 d    1.778442
 e    0.030210
 dtype: float64)

In [60]:
df1

          A         B
a  0.241850  0.423629
b  0.531717  0.447897

In [61]:
df2

          B         A
b  0.482682  0.370908
a  0.580466  0.087741

In [63]:
df1.align(df2, join='inner', axis=0)

(          A         B
 a  0.241850  0.423629
 b  0.531717  0.447897,
           B         A
 a  0.580466  0.087741
 b  0.482682  0.370908)

Filling while reindexing

In [64]:
rng = pd.date_range("1/3/2000", periods=8)
ts = pd.Series(np.random.randn(8), index=rng)

In [74]:
ts2 = ts[[0,3,6]]
ts2

2000-01-03   -0.576412
2000-01-06   -0.837666
2000-01-09   -1.437241
Freq: 3D, dtype: float64

In [75]:
ts

2000-01-03   -0.576412
2000-01-04    0.524654
2000-01-05    0.358542
2000-01-06   -0.837666
2000-01-07   -1.129515
2000-01-08   -0.015926
2000-01-09   -1.437241
2000-01-10   -1.192207
Freq: D, dtype: float64

In [76]:
ts2.reindex(ts.index)

2000-01-03   -0.576412
2000-01-04         NaN
2000-01-05         NaN
2000-01-06   -0.837666
2000-01-07         NaN
2000-01-08         NaN
2000-01-09   -1.437241
2000-01-10         NaN
Freq: D, dtype: float64

In [77]:
ts2.reindex(ts.index, method='ffill')

2000-01-03   -0.576412
2000-01-04   -0.576412
2000-01-05   -0.576412
2000-01-06   -0.837666
2000-01-07   -0.837666
2000-01-08   -0.837666
2000-01-09   -1.437241
2000-01-10   -1.437241
Freq: D, dtype: float64

In [78]:
ts2.reindex(ts.index, method='bfill')

2000-01-03   -0.576412
2000-01-04   -0.837666
2000-01-05   -0.837666
2000-01-06   -0.837666
2000-01-07   -1.437241
2000-01-08   -1.437241
2000-01-09   -1.437241
2000-01-10         NaN
Freq: D, dtype: float64

In [81]:
ts2.reindex(ts.index, method='nearest')

2000-01-03   -0.576412
2000-01-04   -0.576412
2000-01-05   -0.837666
2000-01-06   -0.837666
2000-01-07   -0.837666
2000-01-08   -1.437241
2000-01-09   -1.437241
2000-01-10   -1.437241
Freq: D, dtype: float64

Limits on filling while reindexing

In [84]:
ts2.reindex(ts.index, method='ffill', limit=1)

2000-01-03   -0.576412
2000-01-04   -0.576412
2000-01-05         NaN
2000-01-06   -0.837666
2000-01-07   -0.837666
2000-01-08         NaN
2000-01-09   -1.437241
2000-01-10   -1.437241
Freq: D, dtype: float64

In [85]:
ts2.reindex(ts.index, method='ffill', tolerance='1 day')

2000-01-03   -0.576412
2000-01-04   -0.576412
2000-01-05         NaN
2000-01-06   -0.837666
2000-01-07   -0.837666
2000-01-08         NaN
2000-01-09   -1.437241
2000-01-10   -1.437241
Freq: D, dtype: float64

Dropping labels from an axis

In [87]:
df1

          A         B
a  0.241850  0.423629
b  0.531717  0.447897

In [89]:
df1.drop(['b'], axis=0)

         A         B
a  0.24185  0.423629

In [90]:
df1.drop(['B'], axis=1)

          A
a  0.241850
b  0.531717

Renaming / mapping labels

In [91]:
s

a    0.881986
b   -0.067821
c   -0.414538
d    1.778442
e    0.030210
dtype: float64

In [95]:
s.rename(str.upper)

A    0.881986
B   -0.067821
C   -0.414538
D    1.778442
E    0.030210
dtype: float64

In [98]:
df4

          A         B         C
a  0.310752  0.704818  0.708264
b  0.257842  0.739861  0.220715
c  0.999507  0.472857  0.610499
d  0.397220  0.841648  0.001897

In [100]:
df4.rename({'A': 'One', 'B':'Two'}, axis="columns")

        One       Two         C
a  0.310752  0.704818  0.708264
b  0.257842  0.739861  0.220715
c  0.999507  0.472857  0.610499
d  0.397220  0.841648  0.001897

In [101]:
df4.rename({'a':'First','b':'Second','c':'Third'}, axis='index')

               A         B         C
First   0.310752  0.704818  0.708264
Second  0.257842  0.739861  0.220715
Third   0.999507  0.472857  0.610499
d       0.397220  0.841648  0.001897

In [103]:
df = pd.DataFrame({"x": [1, 2, 3, 4, 5, 6], "y": [10, 20, 30, 40, 50, 60]},
                 index=pd.MultiIndex.from_product([['one','two','three'],[1,2]], names=['let','num']))
df

           x   y
let   num
one   1    1  10
      2    2  20
two   1    3  30
      2    4  40
three 1    5  50
      2    6  60

In [104]:
df.rename_axis(index={'let', 'abs'})

           x   y
abs   let
one   1    1  10
      2    2  20
two   1    3  30
      2    4  40
three 1    5  50
      2    6  60

In [107]:
df.rename_axis(index=str.upper)

           x   y
LET   NUM
one   1    1  10
      2    2  20
two   1    3  30
      2    4  40
three 1    5  50
      2    6  60

### Iteration

In [3]:
df = pd.DataFrame(
     {"col1": np.random.randn(3), "col2": np.random.randn(3)}, index=["a", "b", "c"]
 )
df

       col1      col2
a  2.979600  0.742859
b  0.000304 -0.166563
c  1.144756  0.244222

In [14]:
for index, row in df.iterrows():
    print(index, row, sep='\n')

a
col1    2.979600
col2    0.742859
Name: a, dtype: float64
b
col1    0.000304
col2   -0.166563
Name: b, dtype: float64
c
col1    1.144756
col2    0.244222
Name: c, dtype: float64

### Itertuples

In [16]:
for row in df.itertuples():
    print(row)

Pandas(Index='a', col1=2.9796002065878677, col2=0.7428590824001771)
Pandas(Index='b', col1=0.0003036701200595762, col2=-0.1665629580494829)
Pandas(Index='c', col1=1.1447555365634385, col2=0.2442224329644347)

In [18]:
s = pd.Series(pd.date_range("20130101 09:10:12", periods=4))
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [21]:
s.dt.hour

0    9
1    9
2    9
3    9
dtype: int64

In [22]:
s.dt.second

0    12
1    12
2    12
3    12
dtype: int64

In [23]:
s.dt.day

0    1
1    2
2    3
3    4
dtype: int64

In [24]:
s[s.dt.day == 2]

1   2013-01-02 09:10:12
dtype: datetime64[ns]

In [25]:
stz = s.dt.tz_localize('US/Eastern')
stz

0   2013-01-01 09:10:12-05:00
1   2013-01-02 09:10:12-05:00
2   2013-01-03 09:10:12-05:00
3   2013-01-04 09:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [26]:
s.dt.strftime('%Y/%m/%d')

0    2013/01/01
1    2013/01/02
2    2013/01/03
3    2013/01/04
dtype: object

In [30]:
s = pd.Series(pd.timedelta_range("1 day 00:00:05", periods=4, freq="s"))
s.dt.components

   days  hours  minutes  seconds  milliseconds  microseconds  nanoseconds
0     1      0        0        5             0             0            0
1     1      0        0        6             0             0            0
2     1      0        0        7             0             0            0
3     1      0        0        8             0             0            0

Vectorized string methods

In [31]:
s = pd.Series(
     ["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"], dtype="string"
 )
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5    <NA>
6    caba
7     dog
8     cat
dtype: string

In [32]:
df = pd.DataFrame(
     {
         "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
        "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
         "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
     }
 )
df

        one       two     three
a  0.750158 -0.817973       NaN
b -1.068432 -0.032163  0.284269
c  0.679372  0.928196  0.885989
d       NaN -0.059526  0.316998

In [34]:
usorted_data = df.reindex(
    index=['a','c','b','d'], columns=['three', 'one', 'two']
)
usorted_data

      three       one       two
a       NaN  0.750158 -0.817973
c  0.885989  0.679372  0.928196
b  0.284269 -1.068432 -0.032163
d  0.316998       NaN -0.059526

In [35]:
usorted_data.sort_index()

      three       one       two
a       NaN  0.750158 -0.817973
b  0.284269 -1.068432 -0.032163
c  0.885989  0.679372  0.928196
d  0.316998       NaN -0.059526

In [37]:
usorted_data.sort_index(ascending=False)

      three       one       two
d  0.316998       NaN -0.059526
c  0.885989  0.679372  0.928196
b  0.284269 -1.068432 -0.032163
a       NaN  0.750158 -0.817973

In [39]:
usorted_data["three"].sort_index()

a         NaN
b    0.284269
c    0.885989
d    0.316998
Name: three, dtype: float64

In [45]:
s1 = pd.DataFrame({"a": ["B", "a", "C"], "b": [1, 2, 3], "c": [2, 3, 4]}).set_index(list("ab"))
s1

     c
a b
B 1  2
a 2  3
C 3  4

In [47]:
s1.sort_index(level='a', key=lambda idx: idx.str.lower())

     c
a b
a 2  3
B 1  2
C 3  4

Sort by values

In [48]:
df1 = pd.DataFrame(
    {"one": [2, 1, 1, 1], "two": [1, 3, 2, 4], "three": [5, 4, 3, 2]}
)
df1

   one  two  three
0    2    1      5
1    1    3      4
2    1    2      3
3    1    4      2

In [50]:
df1.sort_values(by='two')

   one  two  three
0    2    1      5
2    1    2      3
1    1    3      4
3    1    4      2

In [51]:
df1.sort_values(by=['one', 'two'])

   one  two  three
2    1    2      3
1    1    3      4
3    1    4      2
0    2    1      5

In [53]:
s.sort_values()

0       A
3    Aaba
1       B
4    Baca
2       C
6    CABA
8     cat
7     dog
5    <NA>
dtype: string

In [54]:
s.sort_values(na_position='first')

5    <NA>
0       A
3    Aaba
1       B
4    Baca
2       C
6    CABA
8     cat
7     dog
dtype: string

Searchsorted

In [55]:
ser = pd.Series([1, 2, 3, 4])

In [56]:
ser.searchsorted([1,4])

array([0, 3], dtype=int64)

In [57]:
ser.searchsorted([3,4])

array([2, 3], dtype=int64)

In [58]:
ser.searchsorted([0,1], side='right')

array([0, 1], dtype=int64)

Smallest / largest values

In [59]:
s = pd.Series(np.random.permutation(10))

In [60]:
s.nsmallest(3)

2    0
8    1
0    2
dtype: int32

In [62]:
s.nlargest(3)

5    9
9    8
7    7
dtype: int32

In [63]:
df = pd.DataFrame(
     {
         "a": [-2, -1, 1, 10, 8, 11, -1],
         "b": list("abdceff"),
         "c": [1.0, 2.0, 4.0, 3.2, np.nan, 3.0, 4.0],
     }
 )

In [67]:
df.nsmallest(3, 'a')

   a  b    c
0 -2  a  1.0
1 -1  b  2.0
6 -1  f  4.0

In [72]:
df.nlargest(3,'c')

    a  b    c
2   1  d  4.0
6  -1  f  4.0
3  10  c  3.2

In [73]:
df.nsmallest(3, ['a','c'])

   a  b    c
0 -2  a  1.0
1 -1  b  2.0
6 -1  f  4.0

In [75]:
df.nlargest(2, ['a','c'])

    a  b    c
5  11  f  3.0
3  10  c  3.2

dtypes

In [76]:
df.dtypes

a      int64
b     object
c    float64
dtype: object

In [85]:
df3 = pd.DataFrame(np.random.rand(8,3), columns=['A','B','C'])
df3

          A         B         C
0  0.380029  0.921514  0.679439
1  0.145706  0.356677  0.935090
2  0.598755  0.417525  0.116647
3  0.921451  0.124366  0.098450
4  0.309425  0.478161  0.189698
5  0.279760  0.416121  0.153963
6  0.813162  0.431173  0.694599
7  0.792533  0.167161  0.681013

In [86]:
df3.dtypes

A    float64
B    float64
C    float64
dtype: object

object conversion

In [87]:
df3.T

,0,1,2,3,4,5,6,7
A,0.380029,0.145706,0.598755,0.921451,0.309425,0.279760,0.813162,0.792533
B,0.921514,0.356677,0.417525,0.124366,0.478161,0.416121,0.431173,0.167161
C,0.679439,0.935090,0.116647,0.098450,0.189698,0.153963,0.694599,0.681013

In [91]:
m = ['1','2','4']
m = pd.to_numeric(m)
m

array([1, 2, 4], dtype=int64)

In [96]:
import datetime
m = ["apple", datetime.datetime(2016, 3, 2)]
pd.to_datetime(m, errors='coerce')

DatetimeIndex(['NaT', '2016-03-02'], dtype='datetime64[ns]', freq=None)

In [97]:
pd.to_datetime(m, errors='ignore')

Index(['apple', 2016-03-02 00:00:00], dtype='object')

In [101]:
m = ['1','2','3','4']
pd.to_numeric(m, downcast='integer')

array([1, 2, 3, 4], dtype=int8)

In [102]:
pd.to_numeric(m, downcast='signed')

array([1, 2, 3, 4], dtype=int8)

In [103]:
pd.to_numeric(m, downcast='unsigned')

array([1, 2, 3, 4], dtype=uint8)

In [104]:
pd.to_numeric(m, downcast='float')

array([1., 2., 3., 4.], dtype=float32)

In [105]:
df = pd.DataFrame([["2016-07-09", datetime.datetime(2016, 3, 2)]] * 2, dtype="O")
df

            0                    1
0  2016-07-09  2016-03-02 00:00:00
1  2016-07-09  2016-03-02 00:00:00

In [106]:
df.apply(pd.to_datetime)

           0          1
0 2016-07-09 2016-03-02
1 2016-07-09 2016-03-02

In [107]:
df = pd.DataFrame([["5us", pd.Timedelta("1day")]] * 2, dtype="O")
df

     0                1
0  5us  1 days 00:00:00
1  5us  1 days 00:00:00

In [108]:
df.apply(pd.to_timedelta)

                       0      1
0 0 days 00:00:00.000005 1 days
1 0 days 00:00:00.000005 1 days

### Selecting columns based on dtype

In [110]:
df = pd.DataFrame(
    {
        "string": list("abc"),
        "int64": list(range(1, 4)),
        "uint8": np.arange(3, 6).astype("u1"),
        "float64": np.arange(4.0, 7.0),
        "bool1": [True, False, True],
        "bool2": [False, True, False],
        "dates": pd.date_range("now", periods=3),
        "category": pd.Series(list("ABC")).astype("category"),
    }
)
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2021-03-31 13:01:11.946468,A
1,b,2,4,5.0,False,True,2021-04-01 13:01:11.946468,B
2,c,3,5,6.0,True,False,2021-04-02 13:01:11.946468,C

In [111]:
df["tdeltas"] = df.dates.diff()

In [114]:
df['unit64'] = np.arange(3,6).astype('u8')

In [115]:
df['other'] = pd.date_range('20200312', periods=3)

In [116]:
df["tz_aware_dates"] = pd.date_range("20130101", periods=3, tz='US/Eastern')

In [117]:
df

,string,int64,uint8,float64,bool1,bool2,dates,category,tdeltas,unit64,other,tz_aware_dates
0,a,1,3,4.0,True,False,2021-03-31 13:01:11.946468,A,NaT,3,2020-03-12,2013-01-01 00:00:00-05:00
1,b,2,4,5.0,False,True,2021-04-01 13:01:11.946468,B,1 days,4,2020-03-13,2013-01-02 00:00:00-05:00
2,c,3,5,6.0,True,False,2021-04-02 13:01:11.946468,C,1 days,5,2020-03-14,2013-01-03 00:00:00-05:00

In [118]:
df.dtypes

string                                object
int64                                  int64
uint8                                  uint8
float64                              float64
bool1                                   bool
bool2                                   bool
dates                         datetime64[ns]
category                            category
tdeltas                      timedelta64[ns]
unit64                                uint64
other                         datetime64[ns]
tz_aware_dates    datetime64[ns, US/Eastern]
dtype: object

In [119]:
df.select_dtypes(include='bool')

   bool1  bool2
0   True  False
1  False   True
2   True  False

In [120]:
df.select_dtypes(include=['bool','number'])

   int64  uint8  float64  bool1  bool2 tdeltas  unit64
0      1      3      4.0   True  False     NaT       3
1      2      4      5.0  False   True  1 days       4
2      3      5      6.0   True  False  1 days       5

In [121]:
df.select_dtypes(include=['bool', 'number'], exclude=['unsignedinteger'])

   int64  float64  bool1  bool2 tdeltas
0      1      4.0   True  False     NaT
1      2      5.0  False   True  1 days
2      3      6.0   True  False  1 days